.emacs.d/init.org
#+TITLE: Emacs Configuration - AI Development Environment
#+AUTHOR: Ebrimasaye
#+DESCRIPTION: Comprehensive Emacs configuration for AI/ML development
#+STARTUP: overview indent
#+OPTIONS: num:nil toc:t
#+BABEL: :cache no :results silent :session none

This is a literate Emacs configuration using Org-Babel. The source code blocks
are tangled to generate =init.el=. To regenerate =init.el= from this file:

  M-x org-babel-tangle

OR: This file is configured to automatically tangle on save (see the setup section
below). Just save with =C-c C-s= and =init.el= will be regenerated.

* Package Management
:PROPERTIES:
:CUSTOM_ID: package-management
:END:

Initialize the package management system and add repositories.

#+BEGIN_SRC emacs-lisp :tangle yes
;;; init.el --- AI Development Environment for Emacs
;;; Commentary:
;;; Comprehensive Emacs configuration for AI/ML development
;;; Optimized for Python, Jupyter, and AI frameworks

;;; Code:

;; ============================================================================
;; PACKAGE MANAGEMENT (must come first)
;; ============================================================================

(require 'package)
(setq package-enable-at-startup nil)

;; Add package repositories
(setq package-archives
      '(("gnu" . "https://elpa.gnu.org/packages/")
        ("melpa" . "https://melpa.org/packages/")
        ("melpa-stable" . "https://stable.melpa.org/packages/")))

;; Pre-load all-the-icons before package-initialize so that
;; major-mode-icons autoloads (which eagerly call all-the-icons functions)
;; don't trigger a void-function error during init.
(let ((ati-dir (car (file-expand-wildcards
                     (expand-file-name "elpa/all-the-icons-*" user-emacs-directory)))))
  (when ati-dir
    (add-to-list 'load-path ati-dir)
    (require 'all-the-icons nil t)))

(package-initialize)
#+END_SRC

* Literate Configuration Loading
:PROPERTIES:
:CUSTOM_ID: literate-config
:END:

Load Org and org-babel for processing other literate config files.

#+BEGIN_SRC emacs-lisp :tangle yes
;;; Load Org and literate configuration files (after package-initialize)
;;; This ensures MELPA Org version is available before requiring it
(setq dotfiles-dir (file-name-directory (or (buffer-file-name) load-file-name)))

(let* ((org-dir (expand-file-name
                    "lisp" (expand-file-name
                            "org" (expand-file-name
                                   "src" dotfiles-dir))))
          (org-contrib-dir (expand-file-name
                            "lisp" (expand-file-name
                                    "contrib" (expand-file-name
                                               ".." org-dir))))
          (load-path (append (list org-dir org-contrib-dir)
                             (or load-path nil))))
  ;; load up Org and Org-babel
  (require 'org)
  (require 'ob-tangle))

;; load up all literate org-mode files in this directory
;; Skip init.org because tangling it regenerates init.el and causes a recursive load.
(mapc #'org-babel-load-file
      (remove (expand-file-name "init.org" dotfiles-dir)
              (directory-files dotfiles-dir t "\\.org$")))

(setq inferior-lisp-program "ros -Q run")
#+END_SRC

* Package Bootstrap
:PROPERTIES:
:CUSTOM_ID: package-bootstrap
:END:

Ensure package contents and bootstrap =use-package=.

#+BEGIN_SRC emacs-lisp :tangle yes
;; Ensure package contents are refreshed if not already
(unless package-archive-contents
  (package-refresh-contents))

;; Bootstrap use-package
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;; Enable :quelpa keyword in use-package (for GitHub-hosted packages)
(require 'quelpa-use-package)
(quelpa-use-package-activate-advice)
#+END_SRC

* Load Path Setup
:PROPERTIES:
:CUSTOM_ID: load-path-setup
:END:

Configure local load paths and manual packages.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; LOAD PATH SETUP (after package bootstrap)
;; ============================================================================

;; Add lisp subdirectory to load-path for local configuration files
(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
(add-to-list 'load-path "~/.emacs.d/lisp/emacs-claude-code")
(require 'emacs-claude-code)

;; TMR (manual package — :ensure nil since it's not from MELPA)
(add-to-list 'load-path "~/.emacs.d/manual-packages/tmr")
(use-package tmr
  :ensure nil
  :config
  (define-key global-map (kbd "C-c T") #'tmr-prefix-map)
  (setq tmr-sound-file "/usr/share/sounds/freedesktop/stereo/alarm-clock-elapsed.oga"
        tmr-notification-urgency 'normal
        tmr-description-list 'tmr-description-history))

;; Sync shell PATH (including nvm, cargo, etc.) into Emacs exec-path.
;; Must run before any :ensure-system-package or executable-find calls.
;; Without this, graphical Emacs launches miss nvm paths and :ensure-system-package
;; incorrectly treats already-installed binaries as missing.
(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x pgtk))
    (exec-path-from-shell-initialize))
  (when (daemonp)
    (exec-path-from-shell-initialize)))
#+END_SRC

* EAF (Emacs Application Framework)
:PROPERTIES:
:CUSTOM_ID: eaf-config
:END:

Configure EAF and its bundled applications with error handling.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; EAF (Emacs Application Framework)
;; ============================================================================

(condition-case err
    (progn
      (add-to-list 'load-path "~/.emacs.d/site-lisp/emacs-application-framework/")
      ;; Ensure MELPA Org is loaded (not just built-in) to avoid version mismatch
      (require 'org)
      (setq eaf-python-command "/usr/bin/python3")  ; Use system Python, not venv

      ;; Persistent storage path — pins the Qt WebEngine cookie database so
      ;; ForcePersistentCookies works reliably across restarts.
      (setq eaf-config-location (expand-file-name "~/.emacs.d/browser/"))

      (require 'eaf)

      ;; Disable geolocation — GeoClue2 D-Bus service denies access for this UID.
      ;; Appends \",Geolocation\" to the existing --disable-features= value so we
      ;; don't produce a duplicate flag (last one wins in Chromium, which would
      ;; silently drop IsolateOrigins and site-per-process).
      (defun my/eaf-disable-geolocation (orig-fun)
        \"Append ,Geolocation to the existing --disable-features flag in QTWEBENGINE_CHROMIUM_FLAGS.\"
        (mapcar (lambda (var)
                  (if (string-match \"\\\\(QTWEBENGINE_CHROMIUM_FLAGS=.*--disable-features=[^ ]*\\\\)\" var)
                      (concat var \",Geolocation\")
                    var))
                (funcall orig-fun)))
      (advice-add 'eaf--build-process-environment :around #'my/eaf-disable-geolocation)

      ;; Core apps
      (require 'eaf-browser)
      (require 'eaf-terminal)
      (require 'eaf-pdf-viewer)
      (require 'eaf-file-manager)
      (require 'eaf-file-browser)
      (require 'eaf-file-sender)
      (require 'eaf-image-viewer)
      (require 'eaf-map)
      (require 'eaf-mindmap)
      (require 'eaf-mind-elixir)
      (require 'eaf-markmap)
      (require 'eaf-org-previewer)
      (require 'eaf-markdown-previewer)
      (require 'eaf-jupyter)
      (require 'eaf-rss-reader)
      (require 'eaf-music-player)
      (require 'eaf-system-monitor)
      (require 'eaf-video-player)
      (require 'eaf-video-editor)
      (require 'eaf-js-video-player)
      (require 'eaf-camera)
      (require 'eaf-git)
      (require 'eaf-pyqterminal)
      (require 'eaf-airshare)

      ;; Extras
      (require 'eaf-2048)
      (require 'eaf-vue-demo)
      (require 'eaf-vue-tailwindcss)
      (require 'eaf-demo)

      (require 'eaf-config)

      (message \"✅ EAF loaded successfully\"))
  (error (message \"❌ EAF failed to load: %s\" err)))
#+END_SRC

