.emacs.d/init.org
* XWidgets Configuration
:PROPERTIES:
:CUSTOM_ID: xwidgets
:END:

Configure XWidgets (WebKitGTK embedded browser).

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; XWIDGETS (WebKitGTK embedded browser)
;; Requires Emacs compiled with --with-xwidgets (snap build has this)
;; ============================================================================

(when (featurep 'xwidget-internal)
  ;; Use xwidget-webkit as the default browser inside Emacs
  (setq browse-url-browser-function #'xwidget-webkit-browse-url)

  ;; Kill the xwidget buffer when its window is closed
  (setq xwidget-webkit-buffer-name-format \"*xwidget: %T*\")

  (with-eval-after-load 'xwidget
    ;; j/k scroll like a browser
    (define-key xwidget-webkit-mode-map (kbd \"j\") #'xwidget-webkit-scroll-up-line)
    (define-key xwidget-webkit-mode-map (kbd \"k\") #'xwidget-webkit-scroll-down-line)
    (define-key xwidget-webkit-mode-map (kbd \"d\") #'xwidget-webkit-scroll-up)
    (define-key xwidget-webkit-mode-map (kbd \"u\") #'xwidget-webkit-scroll-down)
    (define-key xwidget-webkit-mode-map (kbd \"H\") #'xwidget-webkit-back)
    (define-key xwidget-webkit-mode-map (kbd \"L\") #'xwidget-webkit-forward)
    (define-key xwidget-webkit-mode-map (kbd \"r\") #'xwidget-webkit-reload)
    (define-key xwidget-webkit-mode-map (kbd \"o\") #'xwidget-webkit-browse-url)
    (define-key xwidget-webkit-mode-map (kbd \"y\") #'xwidget-webkit-copy-selection-as-kill))

  (global-set-key (kbd \"C-c x\") #'xwidget-webkit-browse-url)
  (message \"✅ xwidgets loaded\"))
#+END_SRC

* Basic Configuration
:PROPERTIES:
:CUSTOM_ID: basic-config
:END:

UI settings, editor defaults, and general preferences.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; BASIC CONFIGURATION
;; ============================================================================

;; UI Configuration
(setq inhibit-startup-message t)
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(global-display-line-numbers-mode 1)
(column-number-mode 1)
(show-paren-mode 1)
(electric-pair-mode 1)

;; Editor settings
(setq-default indent-tabs-mode nil
              tab-width 4
              python-indent-offset 4
              fill-column 88)

;; Better defaults
(setq make-backup-files nil
      auto-save-default nil
      ring-bell-function 'ignore
      gc-cons-threshold 100000000
      read-process-output-max (* 1024 1024))
#+END_SRC

* Themes and UI
:PROPERTIES:
:CUSTOM_ID: themes-ui
:END:

Theme configuration, modeline, dashboard, and visual enhancements.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; THEMES AND UI
;; ============================================================================

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  (load-theme 'doom-one t)
  (doom-themes-visual-bell-config)
  (doom-themes-org-config))

(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :config
  (setq doom-modeline-height 25
        doom-modeline-icon t
        doom-modeline-major-mode-icon t
        doom-modeline-minor-modes nil))

(use-package all-the-icons)

;; Dashboard
(use-package dashboard
  :after all-the-icons
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-startup-banner 'official
        dashboard-center-content t
        dashboard-banner-logo-title "🚀 Welcome to Emacs - AI Development Environment! 🚀"
        dashboard-show-shortcuts nil
        dashboard-items '((recents  . 10)
                         (bookmarks . 5)
                         (projects . 10)
                         (agenda . 5)
                         (registers . 5))
        dashboard-item-names '(("Recent Files:" . "📁 Recent Files:")
                              ("Projects:" . "🗂️  Projects:")
                              ("Bookmarks:" . "🔖 Bookmarks:")
                              ("Agenda for today:" . "📅 Today's Agenda:")
                              ("Registers:" . "📋 Registers:"))
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-set-navigator t)
  ;; Set up navigator buttons only if all-the-icons is available
  (when (and (display-graphic-p) (require 'all-the-icons nil t))
    (setq dashboard-navigator-buttons
          `(((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
             "GitHub"
             "Browse GitHub"
             (lambda (&rest _) (browse-url "https://github.com")))
            (,(all-the-icons-octicon "book" :height 1.1 :v-adjust 0.0)
             "Documentation" 
             "Read the manual"
             (lambda (&rest _) (info-emacs-manual)))
            (,(all-the-icons-material "settings" :height 1.1 :v-adjust 0.0)
             "Settings"
             "Open configuration"
             (lambda (&rest _) (find-file user-init-file)))))))
  :custom
  (initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC

* Completion and Navigation
:PROPERTIES:
:CUSTOM_ID: completion-navigation
:END:

Configure Ivy, Counsel, Company, and related completion systems.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; COMPLETION AND NAVIGATION
;; ============================================================================

(use-package ivy
  :diminish
  :bind ((\"C-s\" . swiper)
         :map ivy-minibuffer-map
         (\"TAB\" . ivy-alt-done)
         (\"C-l\" . ivy-alt-done)
         (\"C-j\" . ivy-next-line)
         (\"C-k\" . ivy-previous-line)
         :map ivy-switch-buffer-map
         (\"C-k\" . ivy-previous-line)
         (\"C-l\" . ivy-done)
         (\"C-d\" . ivy-switch-buffer-kill)
         (\"C-S-d\" . ivy-switch-buffer-other-window)
         :map ivy-reverse-i-search-map
         (\"C-k\" . ivy-previous-line)
         (\"C-d\" . ivy-reverse-i-search-kill))
  :config
  (setq ivy-use-virtual-buffers t
        ivy-count-format \"%d/%d \")
  (ivy-mode 1))

(use-package counsel
  :bind ((\"M-x\" . counsel-M-x)
         (\"C-x b\" . ivy-switch-buffer)
         (\"C-x C-b\" . counsel-ibuffer)
         (\"C-x C-f\" . counsel-find-file)
         :map minibuffer-local-map
         (\"C-r\" . 'counsel-minibuffer-history))
  :config
  (setq ivy-initial-inputs-alist nil))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

;; Smex: M-x sorting by frequency/recency (used by counsel-M-x when present)
(use-package smex
  :after counsel
  :config
  (setq smex-save-file (expand-file-name \"~/.emacs.d/.smex-items\"))
  (smex-initialize))

(use-package company
  :init (global-company-mode)
  :bind (:map company-active-map
         (\"<tab>\" . company-complete-selection)
         (\"C-n\" . company-select-next)
         (\"C-p\" . company-select-previous))
        (:map company-mode-map
         (\"<tab>\" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.1)
  (company-tooltip-align-annotations t)
  (company-selection-wrap-around t)
  :config
  ;; Enable company in scratch buffer and other lisp modes
  (add-hook 'lisp-interaction-mode-hook 'company-mode)
  (add-hook 'emacs-lisp-mode-hook 'company-mode)
  
  ;; Use company-capf for Emacs Lisp completion (replaces deprecated company-elisp)
  ;; company-capf uses completion-at-point-functions which works better with elisp-mode
  
  ;; Configure company for scratch buffer specifically
  (defun setup-scratch-completion ()
    \"Set up enhanced completion for scratch buffer.\"
    (when (string= (buffer-name) \"*scratch*\")
      (company-mode 1)
      (setq-local company-backends 
                  '((company-capf company-dabbrev-code company-keywords)
                    company-dabbrev))))
  
  (add-hook 'lisp-interaction-mode-hook 'setup-scratch-completion))
#+END_SRC

