.emacs.d/init.el
;; VERSION CONTROL
;; ============================================================================

(use-package magit
  :bind (\"C-x g\" . magit-status)
  :config
  (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package git-gutter
  :hook (prog-mode . git-gutter-mode)
  :config
  (setq git-gutter:update-interval 0.02))

;; ============================================================================
;; PROJECT MANAGEMENT
;; ============================================================================

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  (\"C-c p\" . projectile-command-map)
  :init
  (when (file-directory-p \"~/Development\")
    (setq projectile-project-search-path '(\"~/Development\")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))

;; ============================================================================
;; PROGRAMMING LANGUAGES
;; ============================================================================

;; LSP Configuration
(use-package lsp-mode
  :init
  (setq lsp-keymap-prefix \"C-c l\")
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
         (python-mode . lsp)
         (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp
  :config
  (setq lsp-prefer-flymake nil
        lsp-enable-snippet t
        lsp-enable-symbol-highlighting t
        lsp-enable-links t
        lsp-signature-auto-activate t
        lsp-signature-render-documentation t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

;; Python Configuration
(use-package python-mode
  :ensure nil
  :hook (python-mode . lsp-deferred)
  :custom
  (python-shell-interpreter \"python3\")
  (python-shell-interpreter-args \"-i\"))

(use-package pyvenv
  :config
  (pyvenv-mode 1)
  ;; Activate AI environment by default
  (pyvenv-activate \"/home/ebrimasaye/Development/AI/ai-venv\"))

(use-package blacken
  :hook (python-mode . blacken-mode)
  :config
  (setq blacken-line-length 88))

(use-package py-isort
  :hook (python-mode . py-isort-before-save))

(use-package julia-mode
  :ensure t)

(use-package lsp-pyright
  :ensure t
  :custom (lsp-pyright-langserver-command \"pyright\") ;; or basedpyright
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred

;; ============================================================================
;; AI/ML SPECIFIC PACKAGES
;; ============================================================================

;; Jupyter integration
(condition-case err
    (use-package jupyter
      :config
      (setq jupyter-eval-use-overlays t))
  (error (message \"⚠️ Jupyter package failed to load: %s\" err)))

(use-package ein
  :config
  (setq ein:output-area-inlined-images t))

;; Basic org configuration (babel languages configured in org-config.el)
(use-package org
  :ensure nil)

;; ============================================================================
