.emacs.d/init.org
* AI Coding Assistants
:PROPERTIES:
:CUSTOM_ID: ai-assistants
:END:

GitHub Copilot, ChatGPT, Gptel, and other AI integrations.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; AI CODING ASSISTANTS
;; ============================================================================

;; GitHub Copilot Configuration
;; Note: Requires Node.js 20.x or later for the language server
(when (file-directory-p \"~/.emacs.d/copilot\")
  (condition-case err
      (progn
        (add-to-list 'load-path \"~/.emacs.d/copilot\")
        (require 'copilot)
        
        ;; Check Node.js version and provide helpful message
        (let ((node-version (shell-command-to-string \"node --version 2>/dev/null\")))
          (if (string-match \"v\\\\([0-9]+\\\\)\" node-version)
              (let ((version-number (string-to-number (match-string 1 node-version))))
                (if (>= version-number 20)
                    (progn
                      ;; Enhanced language server configuration
                      (setq copilot-node-executable \"node\")
                      
                      ;; Set the path to the language server executable
                      (setq copilot-language-server-executable 
                            (expand-file-name \"~/.local/node_modules/@github/copilot-language-server/native/linux-x64/copilot-language-server\"))
                      
                      ;; Advanced language server settings
                      (setq copilot-lsp-settings
                            '(:github-enterprise (:uri \"\")
                              :completion (:maxCompletions 5
                                         :debounceMs 75
                                         :enableAutoTrigger t
                                         :enablePartialAccept t
                                         :contextLines 50)
                              :ai (:temperature 0.3
                                 :maxTokens 2048
                                 :enableMultilineCompletions t
                                 :streamingEnabled t
                                 :cacheEnabled t)
                              :performance (:maxMemoryMB 512
                                          :enableIncrementalParsing t
                                          :enableBackgroundIndexing t)
                              :security (:enableTelemetry nil
                                       :enableCrashReporting nil)))
                      
                      ;; Enhanced Copilot settings for better performance
                      (setq copilot-idle-delay 0.1)  ; Faster response time
                      (setq copilot-max-char 1000000)  ; Larger context window
                      (setq copilot-completion-auto-accept nil)  ; Manual acceptance
                      
                      ;; Enable debug logging if needed
                      (setq copilot-log-max 1000)  ; Keep more logs for debugging
                      
                      ;; FIXED: Only use supported arguments (--stdio only)
                      (setq copilot-server-args '(\"--stdio\"))
                      
                      ;; Enable copilot in programming modes (start disabled, enable manually)
                      ;; (add-hook 'prog-mode-hook 'copilot-mode)
                      
                      ;; Set up keybindings
                      (define-key copilot-completion-map (kbd \"<tab>\") 'copilot-accept-completion)
                      (define-key copilot-completion-map (kbd \"TAB\") 'copilot-accept-completion)
                      (define-key copilot-completion-map (kbd \"C-TAB\") 'copilot-accept-completion-by-word)
                      (define-key copilot-completion-map (kbd \"C-<tab>\") 'copilot-accept-completion-by-word)
                      
                      ;; Manual activation keybinding
                      (global-set-key (kbd \"C-c C-p\") 'copilot-mode)
                      
                      ;; Optional: Set up additional keybindings
                      (define-key copilot-mode-map (kbd \"M-C-<return>\") 'copilot-accept-completion)
                      (define-key copilot-mode-map (kbd \"M-C-<right>\") 'copilot-accept-completion-by-word)
                      (define-key copilot-mode-map (kbd \"M-C-<down>\") 'copilot-next-completion)
                      (define-key copilot-mode-map (kbd \"M-C-<up>\") 'copilot-previous-completion)
                      
                      (message \"✅ GitHub Copilot available - Use C-c C-p to enable in buffer\"))
                  (message \"⚠️ Copilot requires Node.js 20+. Current: %s. Use 'C-c C-p' to try anyway.\" node-version)))
            (message \"⚠️ Node.js not found. Install Node.js 20+ for Copilot support.\")))
        
        ;; Always set up the manual toggle function
        (defun copilot-toggle ()
          \"Toggle Copilot mode in the current buffer.\"
          (interactive)
          (if copilot-mode
              (progn
                (copilot-mode -1)
                (message \"Copilot disabled\"))
            (progn
              (copilot-mode 1)
              (message \"Copilot enabled\"))))
        
        (global-set-key (kbd \"C-c C-p\") 'copilot-toggle))
    (error (message \"❌ Copilot not available: %s\" err))))

;; ChatGPT integration
(use-package chatgpt-shell
  :config
  (setq chatgpt-shell-openai-key
        (lambda ()
          (auth-source-pass-get 'secret \"openai-key\"))))

;; Gptel
(use-package gptel)
(gptel-make-anthropic \"Claude\" :stream t :key gptel-api-key)
(gptel-make-deepseek \"DeepSeek\"       ;Any name you want
  :stream t                           ;for streaming responses
  :key \"your-api-key\")               ;can be a function that returns the key

;; OPTIONAL configuration
(setq
 gptel-model 'llama4:latest
 gptel-backend (gptel-make-ollama \"Ollama\"
                 :host \"localhost:11434\"
                 :stream t
                 :models '(llama4:latest)))

(gptel-make-gh-copilot \"Copilot\")

(use-package agent-shell
    :ensure t
    :ensure-system-package
    ((claude . \"npm install -g @anthropic-ai/claude-code\")
     (claude-agent-acp . \"npm install -g @zed-industries/claude-agent-acp\")))
#+END_SRC

* Terminal and Shell
:PROPERTIES:
:CUSTOM_ID: terminal-shell
:END:

Configure Vterm and multi-vterm for terminal integration.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; TERMINAL AND SHELL
;; ============================================================================

(use-package vterm
  :config
  (setq vterm-shell \"/bin/zsh\"))

(use-package multi-vterm
  :config
  (add-hook 'vterm-mode-hook
            (lambda ()
              (setq-local evil-insert-state-cursor 'box)
              (evil-insert-state)))
  :bind
  ((\"C-c v\" . multi-vterm-dedicated-toggle)))
#+END_SRC

* Error Checking
:PROPERTIES:
:CUSTOM_ID: error-checking
:END:

Configure Flycheck for on-the-fly error checking.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; FLYCHECK AND ERROR CHECKING
;; ============================================================================

(use-package flycheck
  :init (global-flycheck-mode)
  :config
  (setq flycheck-python-flake8-executable \"flake8\"
        flycheck-python-pylint-executable \"pylint\"
        flycheck-python-mypy-executable \"mypy\"))
#+END_SRC

* Enhanced Lisp Editing
:PROPERTIES:
:CUSTOM_ID: lisp-editing
:END:

Configure Lispy for enhanced Lisp editing experience.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; LISPY - ENHANCED LISP EDITING
;; ============================================================================

(use-package lispy
  :ensure t
  :defer t
  :hook ((emacs-lisp-mode . lispy-mode)
         (lisp-interaction-mode . lispy-mode)
         (lisp-mode . lispy-mode)
         (scheme-mode . lispy-mode))
  :config
  ;; Basic settings
  (setq lispy-compat '(edebug cider)
        lispy-close-quotes-at-end-p t
        lispy-eval-display-style 'overlay
        lispy-no-space nil)
  
  (message \"✅ Lispy mode loaded\"))
#+END_SRC

