.emacs.d/init.org
* Helpful Packages
:PROPERTIES:
:CUSTOM_ID: helpful-packages
:END:

Helpful, expand-region, and multiple-cursors utilities.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; HELPFUL PACKAGES
;; ============================================================================

(use-package helpful
  :bind
  ([remap describe-function] . helpful-function)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-command] . helpful-command)
  ([remap describe-key] . helpful-key))

(use-package expand-region
  :bind (\"C-=\" . er/expand-region))

(use-package multiple-cursors
  :bind ((\"C->\" . mc/mark-next-like-this)
         (\"C-<\" . mc/mark-previous-like-this)
         (\"C-c C-<\" . mc/mark-all-like-this)))
#+END_SRC

* Browser Integration
:PROPERTIES:
:CUSTOM_ID: browser-integration
:END:

Optional browser configuration and integrations.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; BROWSER INTEGRATION
;; ============================================================================

;; Load browser configuration (optional)
(condition-case nil
    (require 'browser-config)
  (error (message \"Browser config not loaded - some features may be unavailable\")))

;; Load comprehensive Org mode configuration
(condition-case nil
    (progn
      (require 'org-config)
      (message \"✅ Org mode configuration loaded successfully\"))
  (error (message \"❌ Failed to load org-config - some Org features may be unavailable\")))

;; Load yt-dlp integration
(condition-case nil
    (progn
      (require 'yt-dlp-config)
      (yt-dlp-setup)
      (message \"✅ yt-dlp integration loaded successfully\"))
  (error (message \"❌ Failed to load yt-dlp-config - media download features may be unavailable\")))

;; Load lambda symbol configuration for Lisp programming
(condition-case err
    (progn
      (require 'lambda-symbol-config-simple)
      (message \"✅ Lambda symbol configuration loaded - Use C-c L h for help\"))
  (error (message \"❌ Failed to load lambda-symbol-config: %s\" err)))

;; Load enhanced Lispy configuration (only if lispy is installed)
(with-eval-after-load 'lispy
  (condition-case err
      (progn
        (require 'lispy-enhanced-config)
        (message \"✅ Lispy enhanced configuration loaded - Use C-c l h for help\"))
    (error (message \"❌ Failed to load lispy-enhanced-config: %s\" err))))
#+END_SRC

* Scratch Buffer Enhancements
:PROPERTIES:
:CUSTOM_ID: scratch-buffer
:END:

Enhanced scratch buffer with completion and persistence.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; SCRATCH BUFFER ENHANCEMENTS
;; ============================================================================

;; Enhance scratch buffer with better default content and completion
(defun enhanced-scratch-buffer ()
  \"Create or switch to an enhanced scratch buffer with helpful content.\"
  (interactive)
  (let ((scratch-buffer (get-buffer-create \"*scratch*\")))
    (with-current-buffer scratch-buffer
      (lisp-interaction-mode)
      (when (zerop (buffer-size))
        (insert \";; Welcome to the Enhanced Emacs Scratch Buffer!
;; This buffer is for Emacs Lisp evaluation and experimentation.
;; 
;; Useful keybindings:
;; C-x C-e  : Evaluate expression before point
;; C-j      : Evaluate expression and insert result
;; M-TAB    : Complete symbol at point
;; TAB      : Company completion (if available)
;;
;; Try some examples:
;; (+ 2 3)
;; (current-time-string)
;; (buffer-list)
;; (apropos \\\"company\\\")

\"))
      (company-mode 1)
      (goto-char (point-max)))
    (switch-to-buffer scratch-buffer)))

;; Add keybinding for enhanced scratch buffer
(global-set-key (kbd \"C-c s\") 'enhanced-scratch-buffer)

;; Make scratch buffer persistent
(defun save-scratch-buffer ()
  \"Save the scratch buffer content to a file.\"
  (interactive)
  (with-current-buffer \"*scratch*\"
    (write-file (expand-file-name \"scratch-backup.el\" user-emacs-directory))
    (rename-buffer \"*scratch*\" t)
    (lisp-interaction-mode)
    (message \"Scratch buffer saved to ~/.emacs.d/scratch-backup.el\")))

(global-set-key (kbd \"C-c S\") 'save-scratch-buffer)

;; Auto-load scratch backup on startup if it exists
(defun load-scratch-backup ()
  \"Load scratch buffer backup if it exists.\"
  (let ((scratch-file (expand-file-name \"scratch-backup.el\" user-emacs-directory)))
    (when (file-exists-p scratch-file)
      (with-current-buffer (get-buffer-create \"*scratch*\")
        (insert-file-contents scratch-file)
        (lisp-interaction-mode)
        (company-mode 1)))))

(add-hook 'emacs-startup-hook 'load-scratch-backup)
#+END_SRC

* Custom AI Functions
:PROPERTIES:
:CUSTOM_ID: custom-ai-functions
:END:

Helper functions for AI development and environment management.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; CUSTOM FUNCTIONS FOR AI DEVELOPMENT
;; ============================================================================

(defun ai-run-chatbot ()
  \"Run the AI chatbot example.\"
  (interactive)
  (let ((default-directory \"/home/ebrimasaye/Development/AI/\"))
    (async-shell-command \"source ai-venv/bin/activate && python examples/llm/first_chatbot.py\")))

(defun ai-run-object-detection ()
  \"Run the object detection demo.\"
  (interactive)
  (let ((default-directory \"/home/ebrimasaye/Development/AI/\"))
    (async-shell-command \"source ai-venv/bin/activate && python examples/vision/object_detection.py --demo\")))

(defun ai-run-speech-recognition ()
  \"Run the speech recognition demo.\"
  (interactive)
  (let ((default-directory \"/home/ebrimasaye/Development/AI/\"))
    (async-shell-command \"source ai-venv/bin/activate && python examples/audio/speech_to_text.py --demo\")))

(defun ai-start-jupyter ()
  \"Start Jupyter Lab server.\"
  (interactive)
  (let ((default-directory \"/home/ebrimasaye/Development/AI/\"))
    (async-shell-command \"source ai-venv/bin/activate && jupyter lab --no-browser\")))

(defun ai-start-ollama ()
  \"Start Ollama service.\"
  (interactive)
  (async-shell-command \"ollama serve\"))

(defun ai-activate-env ()
  \"Activate the AI virtual environment.\"
  (interactive)
  (pyvenv-activate \"/home/ebrimasaye/Development/AI/ai-venv\")
  (message \"AI environment activated\"))
#+END_SRC

* Key Bindings
:PROPERTIES:
:CUSTOM_ID: key-bindings
:END:

Global key bindings for AI development and navigation.

#+BEGIN_SRC emacs-lisp :tangle yes
;; ============================================================================
;; KEY BINDINGS
;; ============================================================================

;; AI Development Keybindings (using C-c A prefix to avoid org-agenda conflict)
(global-set-key (kbd \"C-c A c\") 'ai-run-chatbot)
(global-set-key (kbd \"C-c A v\") 'ai-run-object-detection)
(global-set-key (kbd \"C-c A s\") 'ai-run-speech-recognition)
(global-set-key (kbd \"C-c A j\") 'ai-start-jupyter)
(global-set-key (kbd \"C-c A o\") 'ai-start-ollama)
(global-set-key (kbd \"C-c A e\") 'ai-activate-env)

;; Enhanced Buffer Navigation Keybindings
(global-set-key (kbd \"M-o\") 'ivy-switch-buffer)         ; Quick buffer switch
(global-set-key (kbd \"C-x C-r\") 'counsel-recentf)       ; Recent files
(global-set-key (kbd \"C-c B k\") 'kill-current-buffer)   ; Kill current buffer
(global-set-key (kbd \"C-c B n\") 'next-buffer)          ; Next buffer
(global-set-key (kbd \"C-c B p\") 'previous-buffer)      ; Previous buffer
(global-set-key (kbd \"C-c B s\") 'save-buffer)          ; Save buffer
#+END_SRC

