.emacs.d/init.el
;; CUSTOM VARIABLES
;; ============================================================================

(custom-set-variables
 '(bongo-enabled-backends '(mpg123 vlc mpv ogg123 timidity afplay))
 '(custom-safe-themes
   '(\"4594d6b9753691142f02e67b8eb0fda7d12f6cc9f1299a49b819312d6addad1d\" \"3613617b9953c22fe46ef2b593a2e5bc79ef3cc88770602e7e569bbd71de113b\" \"8d3ef5ff6273f2a552152c7febc40eabca26bae05bd12bc85062e2dc224cde9a\" \"6963de2ec3f8313bb95505f96bf0cf2025e7b07cefdb93e3d2e348720d401425\" \"9b9d7a851a8e26f294e778e02c8df25c8a3b15170e6f9fd6965ac5f2544ef2a9\" \"720838034f1dd3b3da66f6bd4d053ee67c93a747b219d1c546c41c4e425daf93\" \"fffef514346b2a43900e1c7ea2bc7d84cbdd4aa66c1b51946aade4b8d343b55a\" \"aec7b55f2a13307a55517fdf08438863d694550565dee23181d2ebd973ebd6b8\" \"7de64ff2bb2f94d7679a7e9019e23c3bf1a6a04ba54341c36e7cf2d2e56e2bcc\" default))
 '(life-calendar-birthday \"1967-09-09\")
 '(send-mail-function 'mailclient-send-it)
 '(smtpmail-smtp-server \"smtp.gmail.com\")
 '(smtpmail-smtp-service 25)
 '(warning-suppress-log-types '((native-compiler) (gptel) (emacs) ((tar link)) (comp)))
 '(warning-suppress-types
   '((native-compiler)
     (native-compiler)
     (native-compiler)
     (tramp)
     (emacs))))

(custom-set-faces
 ;; Custom faces managed by Emacs
 )

;; ============================================================================
;; STARTUP ACTIONS
;; ============================================================================

(add-hook 'emacs-startup-hook
          (lambda ()
            (message \"🤖 AI Development Environment ready!\")
            (message \"📚 Scratch buffer autocompletion enabled - Press C-c s for enhanced scratch buffer\")
            (message \"📖 Documentation: ~/.emacs.d/SCRATCH_BUFFER_AUTOCOMPLETION.md\")
            (when (file-exists-p \"/home/ebrimasaye/Development/AI/\")
              (find-file \"/home/ebrimasaye/Development/AI/README.md\"))))

;;; init.el ends here
